In [1]:
import pandas as pd
import numpy as np

In [2]:
sales = pd.read_csv("sales.csv")

In [3]:
sales.head()

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   JAN  B300  VZG   20.0
2   FEB  B100  VZG    4.0
3   MAR  B100  VZG   13.0
4   JAN  B100  HYD   30.0

In [4]:
sales.shape

(10, 4)

In [5]:
sales.columns

Index(['Month', 'Book', 'City', 'Units'], dtype='object')

In [6]:
sales.index

RangeIndex(start=0, stop=10, step=1)

In [7]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
Month    10 non-null object
Book     10 non-null object
City     9 non-null object
Units    9 non-null float64
dtypes: float64(1), object(3)
memory usage: 400.0+ bytes

In [8]:
sales.describe(include='all')

       Month  Book City      Units
count     10    10    9   9.000000
unique     3     3    2        NaN
top      JAN  B100  VZG        NaN
freq       4     6    5        NaN
mean     NaN   NaN  NaN  16.111111
std      NaN   NaN  NaN  12.046207
min      NaN   NaN  NaN   4.000000
25%      NaN   NaN  NaN  10.000000
50%      NaN   NaN  NaN  13.000000
75%      NaN   NaN  NaN  20.000000
max      NaN   NaN  NaN  40.000000

### selecting rows and columns

In [9]:
sales[['Month','Units']][:5]

  Month  Units
0   JAN   10.0
1   JAN   20.0
2   FEB    4.0
3   MAR   13.0
4   JAN   30.0

In [10]:
sales.loc[:4, ['Month','Units']]

  Month  Units
0   JAN   10.0
1   JAN   20.0
2   FEB    4.0
3   MAR   13.0
4   JAN   30.0

In [11]:
sales.iloc[:5, [0,3] ]

  Month  Units
0   JAN   10.0
1   JAN   20.0
2   FEB    4.0
3   MAR   13.0
4   JAN   30.0

In [12]:
sales.iloc[:3, :2]

  Month  Book
0   JAN  B100
1   JAN  B300
2   FEB  B100

In [13]:
sales.iloc[[0,4,6], [0,1,3]]

  Month  Book  Units
0   JAN  B100   10.0
4   JAN  B100   30.0
6   MAR  B100   10.0

In [14]:
sales.loc[ [1,4,7], ['Month','Units']]

  Month  Units
1   JAN   20.0
4   JAN   30.0
7   JAN   14.0

In [15]:
sales.iat[0,2]

'VZG'

In [16]:
sales.at[0,'City']

'VZG'

In [17]:
sales['Units'].mean()

16.11111111111111

In [18]:
sales.Month.unique()  # sales['Month'].unique()

array(['JAN', 'FEB', 'MAR'], dtype=object)

In [19]:
sales.dtypes

Month     object
Book      object
City      object
Units    float64
dtype: object

In [20]:
sales.sample(5)

  Month  Book City  Units
8   FEB  B200  HYD    NaN
2   FEB  B100  VZG    4.0
4   JAN  B100  HYD   30.0
7   JAN  B200  VZG   14.0
6   MAR  B100  HYD   10.0

In [21]:
sales.isin( ['JAN','VZG'])

   Month   Book   City  Units
0   True  False   True  False
1   True  False   True  False
2  False  False   True  False
3  False  False   True  False
4   True  False  False  False
5  False  False  False  False
6  False  False  False  False
7   True  False   True  False
8  False  False  False  False
9  False  False  False  False

In [22]:
sales.where( sales['Units'] < 10)

  Month  Book City  Units
0   NaN   NaN  NaN    NaN
1   NaN   NaN  NaN    NaN
2   FEB  B100  VZG    4.0
3   NaN   NaN  NaN    NaN
4   NaN   NaN  NaN    NaN
5   NaN   NaN  NaN    NaN
6   NaN   NaN  NaN    NaN
7   NaN   NaN  NaN    NaN
8   NaN   NaN  NaN    NaN
9   MAR  B200  NaN    4.0

In [23]:
sales.loc[sales['Units'] < 10]

  Month  Book City  Units
2   FEB  B100  VZG    4.0
9   MAR  B200  NaN    4.0

In [24]:
sales.nlargest(3,'Units')

  Month  Book City  Units
5   FEB  B100  HYD   40.0
4   JAN  B100  HYD   30.0
1   JAN  B300  VZG   20.0

In [26]:
sales.filter(regex='t')

  Month City  Units
0   JAN  VZG   10.0
1   JAN  VZG   20.0
2   FEB  VZG    4.0
3   MAR  VZG   13.0
4   JAN  HYD   30.0
5   FEB  HYD   40.0
6   MAR  HYD   10.0
7   JAN  VZG   14.0
8   FEB  HYD    NaN
9   MAR  NaN    4.0

In [30]:
sales.apply(lambda s: s.count(), axis=1)

0    4
1    4
2    4
3    4
4    4
5    4
6    4
7    4
8    3
9    3
dtype: int64

In [33]:
sales[ ['Month','Units']].apply(lambda s: s.count(), axis = 0)  # Column-wise

Month    10
Units     9
dtype: int64

In [39]:
sales.applymap(lambda v : f"-{v:.3}")

  Month  Book  City  Units
0  -JAN  -B10  -VZG  -10.0
1  -JAN  -B30  -VZG  -20.0
2  -FEB  -B10  -VZG   -4.0
3  -MAR  -B10  -VZG  -13.0
4  -JAN  -B10  -HYD  -30.0
5  -FEB  -B10  -HYD  -40.0
6  -MAR  -B10  -HYD  -10.0
7  -JAN  -B20  -VZG  -14.0
8  -FEB  -B20  -HYD   -nan
9  -MAR  -B20  -nan   -4.0

In [43]:
sales.Month.str.find('A')

0    1
1    1
2   -1
3    1
4    1
5   -1
6    1
7    1
8   -1
9    1
Name: Month, dtype: int64

In [47]:
sales[sales['Month'].str.startswith ('J')]

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   JAN  B300  VZG   20.0
4   JAN  B100  HYD   30.0
7   JAN  B200  VZG   14.0

In [49]:
sales.columns.str.lower()

Index(['month', 'book', 'city', 'units'], dtype='object')

### Adding and deleting rows

In [51]:
sales.append( {'Month':'MAR', 'Book' : 'B100', 'Units' : 15}, ignore_index = True)

   Month  Book City  Units
0    JAN  B100  VZG   10.0
1    JAN  B300  VZG   20.0
2    FEB  B100  VZG    4.0
3    MAR  B100  VZG   13.0
4    JAN  B100  HYD   30.0
5    FEB  B100  HYD   40.0
6    MAR  B100  HYD   10.0
7    JAN  B200  VZG   14.0
8    FEB  B200  HYD    NaN
9    MAR  B200  NaN    4.0
10   MAR  B100  NaN   15.0

In [53]:
sales.drop([0,1])

  Month  Book City  Units
2   FEB  B100  VZG    4.0
3   MAR  B100  VZG   13.0
4   JAN  B100  HYD   30.0
5   FEB  B100  HYD   40.0
6   MAR  B100  HYD   10.0
7   JAN  B200  VZG   14.0
8   FEB  B200  HYD    NaN
9   MAR  B200  NaN    4.0

In [55]:
sales.drop(columns=['Book'])

  Month City  Units
0   JAN  VZG   10.0
1   JAN  VZG   20.0
2   FEB  VZG    4.0
3   MAR  VZG   13.0
4   JAN  HYD   30.0
5   FEB  HYD   40.0
6   MAR  HYD   10.0
7   JAN  VZG   14.0
8   FEB  HYD    NaN
9   MAR  NaN    4.0

In [62]:
sales.loc[11] = {'Month':'MAR', 'Book': 'B100','City':'HYD', 'Units' : 10}

In [64]:
sales.loc[12] = ['MAR', 'B200','HYD', 20]

In [65]:
sales

   Month  Book City Units
0    JAN  B100  VZG    10
1    JAN  B300  VZG    20
2    FEB  B100  VZG     4
3    MAR  B100  VZG    13
4    JAN  B100  HYD    30
5    MAR  B100  HYD    10
6    MAR  B100  HYD    10
7    JAN  B200  VZG    14
8    FEB  B200  HYD   NaN
9    MAR  B200  NaN     4
11   MAR  B100  HYD    10
12   MAR  B200  HYD    20

In [66]:
sales['Tax'] = 15

In [67]:
sales

   Month  Book City Units  Tax
0    JAN  B100  VZG    10   15
1    JAN  B300  VZG    20   15
2    FEB  B100  VZG     4   15
3    MAR  B100  VZG    13   15
4    JAN  B100  HYD    30   15
5    MAR  B100  HYD    10   15
6    MAR  B100  HYD    10   15
7    JAN  B200  VZG    14   15
8    FEB  B200  HYD   NaN   15
9    MAR  B200  NaN     4   15
11   MAR  B100  HYD    10   15
12   MAR  B200  HYD    20   15